# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Brews
brew "minikube"
brew "neovim"
brew "exa"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "git-delta"
brew "direnv"
brew "tmux"
brew "wget"
brew "urlview"
brew "gnupg"
brew "lastpass-cli"

brew "go"
brew "pyenv"
# nvm is managed through chezmoi

# Casks
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"

cask "iterm2"
cask "google-chrome"
cask "lastpass"
cask "spotify"
cask "element"
cask "docker"
cask "visual-studio-code"
cask "vimr"
