# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "charmbracelet/tap"
tap "go-task/tap"

# Formulae

brew "coreutils"
brew "readline"
brew "gnu-sed"
brew "gawk"
brew "gnupg"
brew "tldr"
brew "tree"
brew "git"
brew "svn"
brew "wget"

brew "trash"

brew "fish"
brew "fisher"
brew "nushell"
brew "fzf"

brew "vim"
brew "helix"

brew "lazygit"
brew "lazydocker"

brew "git-crypt"
brew "git-lfs"
brew "git-delta"
brew "gh"
brew "pinentry-mac"

brew "direnv"
brew "urlview"
brew "gron"

brew "ddgr"
brew "grc"

brew "gum"
brew "glow"
brew "wishlist"

brew "exa"
brew "bat"
brew "broot"
brew "procs"
brew "dust"
brew "ripgrep"
brew "fd"

brew "graphviz"

brew "jq"
brew "yq"

brew "httpie"
brew "abduco"
brew "gotop"
brew "postgresql@15"
brew "pinentry-mac"

brew "prettier"

brew "sqlite3"
brew "xz"
brew "minikube"
brew "kubectx"

brew "imagemagick"
brew "helm"

brew "hugo"
brew "yarn"
brew "awscli"
brew "ansifilter"

brew "go"
brew "go-task"
brew "sqlc"
brew "golangci-lint"
brew "mockery"

# Casks
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "font-hack-nerd-font"
cask "font-cascadia-mono"
cask "font-cascadia-code"

cask "spotify"
cask "docker"
cask "visual-studio-code"
cask "google-cloud-sdk"
cask "chrysalis"

cask "authy"
cask "github"
cask "rectangle"
cask "wezterm"

# Machine-Specific

{{- if eq .location "basil" }}
cask "element"
cask "qmk-toolbox"
cask "google-chrome"
cask "slack"
{{ end }}

{{- if eq .location "thyme" }}
brew "ansible"
cask "1password"
cask "goland"
cask "miniconda"
{{ end }}
