# Taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "charmbracelet/tap"
tap "go-task/tap"
tap "nikitabobko/tap"
tap "koekeishiya/formulae"

# Formulae

brew "coreutils" # GNU File, Shell, and Text utilities
brew "readline" # Library for command-line editing
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "gawk" # GNU awk utility
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "tldr" # Simplified and community-driven man pages
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "git" # Distributed revision control system
brew "wget" # Internet file retriever
brew "align" # Text column alignment filter

brew "trash" # CLI tool that moves files or folder to the trash

brew "fish" # User-friendly command-line shell for UNIX-like operating systems
brew "fisher" # Plugin manager for the Fish shell
brew "nushell" # Modern shell for the GitHub era
brew "fzf" # Command-line fuzzy finder written in Go
brew "elvish" # Friendly and expressive shell

brew "neovim" # Vi 'workalike' with many additional features
brew "helix" # Post-modern modal text editor

brew "grpcurl" # Like cURL, but for gRPC
brew "act" # Run your GitHub Actions locally

brew "lazygit" # Simple terminal UI for git commands
brew "lazydocker" # Lazier way to manage everything docker

brew "git-crypt" # Enable transparent encryption/decryption of files in a git repo
brew "git-lfs" # Git extension for versioning large files
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "gh" # GitHub command-line tool
brew "ghq" # Remote repository management made easy

brew "pinentry-mac" # Pinentry for GPG on Mac

brew "direnv" # Load/unload environment variables based on $PWD
brew "urlview" # URL extractor/launcher
brew "gron" # Make JSON greppable

brew "ddgr" # DuckDuckGo from the terminal
brew "grc" # Colorize logfiles and command output

brew "gum" # Tool for glamorous shell scripts
brew "glow" # Render markdown on the CLI
brew "wishlist" # The SSH directory
brew "vhs" # Your CLI home video recorder

brew "eza"
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "broot" # New way to see and navigate directory trees
brew "procs" # Modern replacement for ps written by Rust
brew "dust" # More intuitive version of du in rust
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "fd" # Simple, fast and user-friendly alternative to find
brew "pwgen" # Password generator
brew "numbat"
brew "just"

brew "rustup" # Rust toolchain installer


brew "hey" # HTTP load generator, ApacheBench (ab) replacement

brew "viddy" # Modern watch command
brew "circumflex" # Hacker News in your terminal

brew "graphviz" # Graph visualization software from AT&T and Bell Labs

brew "jq" # Lightweight and flexible command-line JSON processor
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI

brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "abduco" # Provides session management: i.e. separate programs from terminals
brew "gotop" # Terminal based graphical activity monitor inspired by gtop and vtop
brew "postgresql@15" # Object-relational database system
brew "pinentry-mac" # Pinentry for GPG on Mac

brew "prettier" # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML

brew "sqlite3" # Command-line interface for SQLite
brew "xz" # General-purpose data compression with high compression ratio
brew "minikube" # Run a Kubernetes cluster locally
brew "kubectx" # Tool that can switch between kubectl contexts easily and create aliases

brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "helm" # Kubernetes package manager

brew "hugo" # Configurable static site generator
brew "yarn" # JavaScript package manager
brew "awscli" # Official Amazon AWS command-line interface
brew "ansifilter" # Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode

brew "go" # Open source programming language to build simple/reliable/efficient software
brew "go-task" # Task is a task runner/build tool that aims to be simpler and easier to use
brew "sqlc" # Generate type safe Go from SQL
brew "mage" # Make/rake-like build tool using Go


brew "kind" # Run local Kubernetes cluster in Docker
brew "protobuf" # Protocol buffers (Google's data interchange format)

brew "kubebuilder" # SDK for building Kubernetes APIs using CRDs
brew "jsonnet" # Domain specific configuration language for defining JSON data
brew "pyenv" # Python version management
brew "tfenv" # Terraform version manager inspired by rbenv

brew "stylua" # Opinionated Lua code formatter
brew "openjdk" # Development kit for the Java programming language

brew "yabai"
brew "skhd"

# Casks
cask "font-jetbrains-mono" # Developer targeted fonts with a high number of glyphs
cask "font-hack" # Developer targeted fonts with a high number of glyphs
cask "font-monaspace"
cask "font-source-code-pro"

cask "spotify" # Music streaming service
cask "docker" # App to build and share containerized applications and microservices
cask "visual-studio-code" # Open-source code editor
cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted on Google Cloud
cask "chrysalis" # Graphical configurator for Kaleidoscope-powered keyboards
cask "github" # Desktop client for GitHub repositories
cask "kitty" # GPU-based terminal emulator
cask "firefox" # Web browser
cask "gimp" # Free and open-source image editor
cask "tableplus" # Native GUI tool for relational databases
cask "zed" # Multiplayer code editor
cask "jetbrains-toolbox" # JetBrains tools manager

cask "raycast"

cask "warp"

# Machine-Specific
{{- if eq .location "basil" }}
cask "element" # Matrix collaboration client
cask "qmk-toolbox" # Toolbox companion for QMK Firmware
cask "google-chrome" # Web browser
cask "slack" # Team communication and collaboration software
cask "steam" # Video game digital distribution service
cask "tailscale" # Mesh VPN based on WireGuard
{{- end }}

{{- if eq .location "thyme" }}
cask "1password" # Password manager that keeps all passwords secure behind one password
cask "1password-cli" # Command-line interface for 1Password
cask "miniconda" # Minimal installer for conda
brew "clang-format" # Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
{{- end }}
