franciscolourenco/done
danhper/fish-fastdir
jorgebucaran/hydro
jorgebucaran/autopair.fish@1.0.3
jorgebucaran/spark.fish
ivakyb/fish_ssh_agent
danhper/fish-ssh-agent
meaningful-ooo/sponge
