franciscolourenco/done
danhper/fish-fastdir
danhper/fish-ssh-agent
jorgebucaran/hydro
jorgebucaran/replay.fish@1.2.0
jorgebucaran/autopair.fish@1.0.3
jorgebucaran/nvm.fish@2.2.7
lilyball/nix-env.fish
patrickf1/fzf.fish
andreiborisov/sponge@1.0.4
