franciscolourenco/done
danhper/fish-fastdir
jorgebucaran/hydro
jorgebucaran/autopair.fish@1.0.3
jorgebucaran/nvm.fish@2.2.7
jorgebucaran/spark.fish
patrickf1/fzf.fish
ivakyb/fish_ssh_agent
