# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Brews
brew "minikube"
brew "neovim"
brew "exa"
brew "tree"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "git-delta"
brew "gh"
brew "direnv"
brew "tmux"
brew "wget"
brew "urlview"

brew "ripgrep"

brew "gnupg"
brew "pinentry-mac"
brew "lastpass-cli"

brew "go"
brew "pyenv"
# nvm is managed through chezmoi

brew "gopls"
brew "eslint"
brew "stylua"

brew "gcc"
brew "llvm"
brew "cmake"
brew "libomp"
brew "open-mpi"

brew "boost"
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

# Casks
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"

cask "kitty"
cask "lastpass"
cask "spotify"
cask "element"
cask "docker"
cask "visual-studio-code"
cask "vimr"
